soap-examples/send-mail-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
	xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
	<soap:Header>
		<t:RequestServerVersion Version="Exchange2010_SP1"></t:RequestServerVersion>
	</soap:Header>
	<soap:Body>
		<m:CreateItem MessageDisposition="SendOnly">
			<m:Items>
				<t:Message>
					<t:Subject>From EWS</t:Subject>
					<t:Body BodyType="HTML">Using the Microsoft EWS Managed API</t:Body>
					<t:ToRecipients>
						<t:Mailbox>
							<t:EmailAddress>test.test@test.com</t:EmailAddress>
						</t:Mailbox>
					</t:ToRecipients>
				</t:Message>
			</m:Items>
		</m:CreateItem>
	</soap:Body>
</soap:Envelope>